import sys

input = sys.stdin.readline

N, M = map(int, input().strip().split(' '))

arr = [[0] * M for _ in range(N)]

for i in range(N):
    line = list(map(int, input().strip().split(' ')))
    for j in range(M):
        arr[i][j] = line[j]

s1 = [(0, 0), (0, 1), (0, 2), (0, 3)]
s2 = [(0, 0), (1, 0), (2, 0), (3, 0)]

s3 = [(0, 0), (0, 1), (1, 0), (1, 1)]

s4 = [(0, 0), (1, 0), (2, 0), (2, 1)]
s5 = [(0, 0), (0, -1), (0, -2), (1, -2)]
s6 = [(0, 0), (-1, 0), (-2, 0), (-2, -1)]
s7 = [(0, 0), (0, 1), (0, 2), (-1, 2)]

s8 = [(0, 0), (1, 0), (2, 0), (2, -1)]
s9 = [(0, 0), (0, -1), (0, -2), (-1, -2)]
s10 = [(0, 0), (-1, 0), (-2, 0), (-2, 1)]
s11 = [(0, 0), (0, 1), (0, 2), (1, 2)]

s8 = [(0, 0), (1, 0), (2, 0), (2, -1)]
s9 = [(0, 0), (0, -1), (0, -2), (-1, -2)]
s10 = [(0, 0), (-1, 0), (-2, 0), (-2, 1)]
s11 = [(0, 0), (0, 1), (0, 2), (1, 2)]

s12 = [(0, 0), (1, 0), (1, 1), (2, 1)]
s13 = [(0, 0), (0, 1), (-1, 1), (-1, 2)]

s14 = [(0, 0), (1, 0), (1, -1), (2, -1)]
s15 = [(0, 0), (0, 1), (1, 1), (1, 2)]

s16 = [(0, 0), (0, 1), (0, -1), (-1, 0)]
s17 = [(0, 0), (-1, 0), (0, 1), (1, 0)]
s18 = [(0, 0), (0, 1), (1, 0), (0, -1)]
s19 = [(0, 0), (1, 0), (0, -1), (-1, 0)]

shapes = [s1, s2, s3, s4, s5, s6, s7, s8, s9, s10, s11, s12, s13, s14, s15, s16, s17, s18, s19]

sample = 0

for i in range(N):
    for j in range(M):

        # 모든 모양 체크
        for shape in shapes:
            isOk = True
            tmp = 0
            # 특정 모양 범위 벗어나는지 체크
            for s in shape:
                cx, cy = s

                nx, ny = i + cx, j + cy

                if not (0 <= nx < N and 0 <= ny < M):
                    isOk = False
                    break
                tmp += arr[nx][ny]

            if isOk:
                sample = max(sample, tmp)

print(sample)
